# -*- coding: euc-kr -*-
from xingAsync import *
from common import *
from app_key import user_id, user_pwd, cert_pwd # app_key.py 파일에 사용자 ID, 비번, 공증 비번을 저장해두고 import

async def sample(api: XingApi):
    if not await api.login(user_id, user_pwd, cert_pwd):
        return print(f"로그인 실패: {api.last_message}")
    
    inputs = {
        'shcode': '005930',     # 삼성전자
        'gubun': '2',           # 주기구분(2:일3:주4:월5:년)
        'qrycnt': 500,          # 요청건수(최대-압축:2000비압축:500)
        'sdate': '',            # 시작일자
        'edate': '99999999',    # 종료일자
        'cts_date': '',         # 연속일자
        'comp_yn': 'N',         # 압축여부(Y:압축N:비압축)
        'sujung': 'Y',          # 수정주가여부(Y:적용N:비적용)
    }
    response = await api.request("t8410", inputs)
    if not response: return print(f'요청실패: {api.last_message}')

    all_data = response['t8410OutBlock1']

     # 연속조회
    if response.cont_yn: # 연속조회가능
        inputs['cts_date'] = response['t8410OutBlock']['cts_date']
        response = await api.request("t8410", inputs, True)
        if not response: return print(f'연속요청 실패: {api.last_message}')
        all_data = response['t8410OutBlock1'] + all_data

    print(all_data)

if __name__ == "__main__":
    api = XingApi()
    run_loop(sample(api))

# Output:
'''
Row Count = 1000
+----------+-------+-------+-------+-------+-----------+---------+---------+------+----------+-----------+------+
|   date   |  open |  high |  low  | close | jdiff_vol |  value  | jongchk | rate | pricechk | ratevalue | sign |
+----------+-------+-------+-------+-------+-----------+---------+---------+------+----------+-----------+------+
| 20201030 | 58000 | 58000 | 56600 | 56600 |  26907844 | 1541223 |    0    | 0.0  |    0     |     0     |  5   |
| 20201102 | 56400 | 57500 | 56000 | 57400 |  20489076 | 1165273 |    0    | 0.0  |    0     |     0     |  2   |
| 20201103 | 57900 | 58900 | 57600 | 58800 |  14950919 |  873636 |    0    | 0.0  |    0     |     0     |  2   |
| 20201104 | 58900 | 59000 | 57800 | 58500 |  21718561 | 1269055 |    0    | 0.0  |    0     |     0     |  5   |
| 20201105 | 59000 | 60300 | 58800 | 60300 |  20639475 | 1232654 |    0    | 0.0  |    0     |     0     |  2   |
| 20201106 | 60700 | 60800 | 59600 | 60100 |  16910230 | 1015446 |    0    | 0.0  |    0     |     0     |  5   |
| 20201109 | 60700 | 60900 | 60100 | 60200 |  15892961 |  962262 |    0    | 0.0  |    0     |     0     |  2   |
...
| 20241114 | 50200 | 51800 | 49900 | 49900 |  45688129 | 2322056 |    0    | 0.0  |    0     |     0     |  5   |
| 20241115 | 50300 | 54200 | 50300 | 53500 |  44273164 | 2332587 |    0    | 0.0  |    0     |     0     |  2   |
| 20241118 | 57000 | 57500 | 55900 | 56700 |  47922973 | 2716382 |    0    | 0.0  |    0     |     0     |  2   |
| 20241119 | 56500 | 57500 | 55900 | 56300 |  31539632 | 1786885 |    0    | 0.0  |    0     |     0     |  5   |
| 20241120 | 56100 | 56500 | 54800 | 55300 |  20834397 | 1154360 |    0    | 0.0  |    0     |     0     |  5   |
| 20241121 | 54900 | 55600 | 54700 | 55500 |  5067818  |  279594 |    0    | 0.0  |    0     |     0     |  2   |
+----------+-------+-------+-------+-------+-----------+---------+---------+------+----------+-----------+------+
'''