# -*- coding: euc-kr -*-
from xingAsync import *
from common import *
from app_key import user_id, user_pwd, cert_pwd # app_key.py 파일에 사용자 ID, 비번, 공증 비번을 저장해두고 import

async def sample(api: XingApi):
    if not await api.login(user_id, user_pwd, cert_pwd):
        return print(f"로그인 실패: {api.last_message}")

    keysymbol = '82TSLA' # 82TSLA: 테슬라, 82AAPL: 애플

    response = await api.request("g3104", ['R', keysymbol, keysymbol[:2], keysymbol[2:]])
    if not response: return print(f'요청실패: {api.last_message}')

    print(response)

if __name__ == "__main__":
    api = XingApi()
    run_loop(sample(api))

# Output:
'''
g3104: [00000] 조회완료
g3104InBlock, Fields = 4, Count = 1
+---------+-----------+--------+--------+
| delaygb | keysymbol | exchcd | symbol |
+---------+-----------+--------+--------+
|    R    |   82TSLA  |   82   |  TSLA  |
+---------+-----------+--------+--------+
g3104OutBlock, Fields = 34, Count = 1
+---------+-----------+--------+----------+--------+---------+-----------+---------------+-------------+----------------+----------+------------+----------+---------+----------+------------+--------+------------+------------+----------+-------------+-------+-------+-------+----------+-------+---------+----------+---------------+-------+------+--------+-------------+-------------+
| delaygb | keysymbol | exchcd | exchange | symbol | korname |  engname  | exchange_name | nation_name |    induname    | instname | floatpoint | currency | suspend | sellonly |   share    | untprc | bidlotsize | asklotsize |  volume  |    amount   |  pcls |  clos |  open |   high   |  low  | high52p |  low52p  |    shareprc   |  perv | epsv | exrate | bidlotsize2 | asklotsize2 |
+---------+-----------+--------+----------+--------+---------+-----------+---------------+-------------+----------------+----------+------------+----------+---------+----------+------------+--------+------------+------------+----------+-------------+-------+-------+-------+----------+-------+---------+----------+---------------+-------+------+--------+-------------+-------------+
|    R    |   82TSLA  |   82   |   0537   |  TSLA  |  테슬라 | TESLA INC |     나스닥    |     미국    | 자동차 및 부품 |   주식   |     4      |   USD    |    N    |    0     | 3210060000 |  0.01  |     1      |     1      | 50690663 | 17227510001 | 346.0 | 346.0 | 345.0 | 346.5999 | 334.3 |  358.64 | 138.8025 | 1097936821799 | 94.78 | 3.65 | 1392.0 |      1      |      1      |
+---------+-----------+--------+----------+--------+---------+-----------+---------------+-------------+----------------+----------+------------+----------+---------+----------+------------+--------+------------+------------+----------+-------------+-------+-------+-------+----------+-------+---------+----------+---------------+-------+------+--------+-------------+-------------+
nRqID=21, cont_yn=False, cont_key=
+----------------------------+
|  request / elapsed times   |
+----------------------------+
| 2024-11-21 07:07:39.269630 |
|       0:00:00.003999       |
+----------------------------+
'''