# -*- coding: euc-kr -*-
from xingAsync import *
from common import *
from app_key import user_id, user_pwd, cert_pwd, acc_pwd_number # app_key.py 파일에 사용자 ID, 비번, 공증 비번, 계좌비번을 저장해두고 import

async def sample(api: XingApi):
    if not await api.login(user_id, user_pwd, cert_pwd):
        return print(f"로그인 실패: {api.last_message}")

    # 계좌번호 가져오기
    acc_name = "종합매매"
    acc = next((item for item in api.accounts if item.detail_name == acc_name), None)
    if not acc: return print(f"{acc_name} 계좌가 없습니다.")
    pass_number = "0000" if api.is_simulation else acc_pwd_number

    # COSOQ02701: 해외주식 예수금 조회 API
    inputs = {'RecCnt': 1, 'AcntNo': acc.number, 'Pwd': pass_number, 'CrcyCode': 'ALL'}
    response = await api.request("COSOQ02701", inputs)
    if not response: return print(f'요청실패: {api.last_message}')

    print(response)

if __name__ == "__main__":
    api = XingApi()
    run_loop(sample(api))

# Output:
'''
COSOQ02701: [00136] 조회가 완료되었습니다.
COSOQ02701InBlock1, Fields = 4, Count = 1
+--------+-------------+------+----------+
| RecCnt |    AcntNo   | Pwd  | CrcyCode |
+--------+-------------+------+----------+
| 00001  | XXXXXXXXXXX | 0000 |   ALL    |
+--------+-------------+------+----------+
COSOQ02701OutBlock1, Fields = 4, Count = 1
+--------+-------------+----------+----------+
| RecCnt |    AcntNo   |   Pwd    | CrcyCode |
+--------+-------------+----------+----------+
|   1    | XXXXXXXXXXX | ******** |   ALL    |
+--------+-------------+----------+----------+
COSOQ02701OutBlock2, Fields = 17, Count = 4
+----------+-------------------+-------------------+-------------------+-------------------+--------------------+--------------------+--------------------+--------------------+-----------------+-----------------+-----------------+-----------------+---------------------+---------------------+---------------------+---------------------+
| CrcyCode | FcurrBuyAdjstAmt1 | FcurrBuyAdjstAmt2 | FcurrBuyAdjstAmt3 | FcurrBuyAdjstAmt4 | FcurrSellAdjstAmt1 | FcurrSellAdjstAmt2 | FcurrSellAdjstAmt3 | FcurrSellAdjstAmt4 | PrsmptFcurrDps1 | PrsmptFcurrDps2 | PrsmptFcurrDps3 | PrsmptFcurrDps4 | PrsmptMxchgAbleAmt1 | PrsmptMxchgAbleAmt2 | PrsmptMxchgAbleAmt3 | PrsmptMxchgAbleAmt4 |
+----------+-------------------+-------------------+-------------------+-------------------+--------------------+--------------------+--------------------+--------------------+-----------------+-----------------+-----------------+-----------------+---------------------+---------------------+---------------------+---------------------+
|   JPY    |        0.0        |        0.0        |        0.0        |        0.0        |        0.0         |        0.0         |        0.0         |        0.0         |       0.0       |       0.0       |       0.0       |       0.0       |         0.0         |         0.0         |         0.0         |         0.0         |
|   HKD    |        0.0        |        0.0        |        0.0        |        0.0        |        0.0         |        0.0         |        0.0         |        0.0         |       0.0       |       0.0       |       0.0       |       0.0       |         0.0         |         0.0         |         0.0         |         0.0         |
|   CNY    |        0.0        |        0.0        |        0.0        |        0.0        |        0.0         |        0.0         |        0.0         |        0.0         |       0.0       |       0.0       |       0.0       |       0.0       |         0.0         |         0.0         |         0.0         |         0.0         |
|   USD    |        0.0        |        0.0        |        0.0        |        0.0        |        0.0         |        0.0         |        0.0         |        0.0         |       0.0       |       0.0       |       0.0       |       0.0       |         0.0         |         0.0         |         0.0         |         0.0         |
+----------+-------------------+-------------------+-------------------+-------------------+--------------------+--------------------+--------------------+--------------------+-----------------+-----------------+-----------------+-----------------+---------------------+---------------------+---------------------+---------------------+
COSOQ02701OutBlock3, Fields = 11, Count = 2
+---------+----------+------------+----------+-----------------+------------------+-------------+--------------+------------------+-------------------+------------+
| CntryNm | CrcyCode | T4FcurrDps | FcurrDps | FcurrOrdAbleAmt | PrexchOrdAbleAmt | FcurrOrdAmt | FcurrPldgAmt | ExecRuseFcurrAmt | FcurrMxchgAbleAmt | BaseXchrat |
+---------+----------+------------+----------+-----------------+------------------+-------------+--------------+------------------+-------------------+------------+
|   미국  |   USD    |    0.0     |   0.0    |       0.0       |       0.0        |     0.0     |     0.0      |       0.0        |        0.0        |   1392.0   |
|   홍콩  |   HKD    |    0.0     |   0.0    |       0.0       |       0.0        |     0.0     |     0.0      |       0.0        |        0.0        |   178.84   |
+---------+----------+------------+----------+-----------------+------------------+-------------+--------------+------------------+-------------------+------------+
COSOQ02701OutBlock4, Fields = 5, Count = 1
+--------+--------------+---------------+------------------+---------+
| RecCnt | WonDpsBalAmt | MnyoutAbleAmt | WonPrexchAbleAmt | OvrsMgn |
+--------+--------------+---------------+------------------+---------+
|   1    |      0       |       0       |        0         |    0    |
+--------+--------------+---------------+------------------+---------+
COSOQ02701OutBlock5, Fields = 2, Count = 1
+--------+---------+
| RecCnt | NrfCode |
+--------+---------+
|   1    |    01   |
+--------+---------+
nRqID=24, cont_yn=False, cont_key=
+----------------------------+
|  request / elapsed times   |
+----------------------------+
| 2024-11-21 06:47:10.561881 |
|       0:00:00.529630       |
+----------------------------+
'''